# ICustomFieldProperties Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ICustomFieldProperties Interface
Members See Also
---
Represents the base class for the properties of a custom field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public interface ICustomFieldProperties
```

Visual Basic
---
```text
Public Interface ICustomFieldProperties
```

Visual C++
---
```text
public interface class ICustomFieldProperties
```

# See Also
ICustomFieldProperties Members
Autodesk.Revit.DB Namespace